# Getting started tutorials

## What kind of data does pandas handle ?

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
    {
        'Nom' : [
            'Jean',
            'Pierre',
            'Jacques',
        ],
        'Âge' : [
            25,
            30,
            35,
        ],
        'Pays' : [
            'France',
            'Belgique',
            'Suisse',
        ]
    }
)

df

       Nom  Âge      Pays
0     Jean   25    France
1   Pierre   30  Belgique
2  Jacques   35    Suisse

Pour avoir juste une colonne on peut l'extraire comme ceci

In [3]:
df['Nom']

0       Jean
1     Pierre
2    Jacques
Name: Nom, dtype: object

On peut aussi créer une série comme ceci :

In [5]:
ages = pd.Series([22,35,46], name='Age')
ages

0    22
1    35
2    46
Name: Age, dtype: int64

Avec une série, on peut appliquer des fonctions prédéfinies, comme max(), min(), sum() ou mean() pour calculer des statistiques :

In [6]:
ages.min()

22

In [7]:
ages.mean()

34.333333333333336

Et pour avoir des statistiques basiques sur un dataframe, on peut utiliser describe()

In [8]:
df.describe()

        Âge
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

## How do I read and write tabular data ?

In [9]:
titanic = pd.read_csv('../data/titanic.csv')

In [10]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [13]:
titanic.to_excel('../output/titanic.xlsx', sheet_name='passengers', index=False)

for technical information, do info()

In [14]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## How do I select a subset of a DataFrame ?

## Columns

On a déjà vu comment sélectionner une seule colonne, on peut faire la même chose pour plusieurs

In [16]:
age_sex = titanic[['Age', 'Sex']]
age_sex.head()

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

In [18]:
age_sex.shape

(891, 2)

## Row